Polish software delivery reference documentation
